# Ejercicios

1. Haz las importaciones necesarias para establecer la conxión y trabajar con Pandas.Establece la conexión usando mysql.connector utilizando try/except por si la conexión devielve un error.

In [1]:
# Importar librería para la conexión con MySQL
# -----------------------------------------------------------------------
import mysql.connector
from mysql.connector import errorcode


# Importar librerías para manipulación y análisis de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

In [2]:
# En este código estamos haciendo un try except. Si recordamos esto nos permitía hacer un manejo de los errores, para evitar que nuestro código se pare. Para eso lo que estamos haciendo es
## intenta hacer la conexión son la base de datos de tienda 
try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',)
# en caso de que no lo consigas por que hay algún error entonces ...
except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)
else:
  cnx.close()

2. Crea un nuevo "schema" llamado "alumnas-promo-H"

In [4]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE DATABASE alumnas_promo_H")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE DATABASE alumnas_promo_H

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [5]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_H')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE TABLE ALUMNAS_PROMO (ID INT,NOMBRE VARCHAR(100), APELLIDOS VARCHAR(100),CIUDAD VARCHAR (100), TELEFONO VARCHAR(30))")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE TABLE ALUMNAS_PROMO (ID INT,NOMBR..

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [9]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_H')


mycursor = cnx.cursor()
sql_isert_alumnas = "INSERT INTO ALUMNAS_PROMO (ID, NOMBRE, APELLIDOS, CIUDAD ,TELEFONO) VALUES (%s, %s,%s,%s,%s)"
val = [
  (1 ,'Nuria', 'Cano Girones','Madrid','1234657810'),
  (2, 'Patricia', 'González Gruber','Valencia','1289546107'),
  (3,'Margarita', 'Torres Rodriguez','Madrid','1287854107'),
  (4, 'Violaine', 'Deloutsal','Madrid','1281234107'),
  (5, 'Diana', 'García Martín','Madrid','1284312107'),
  (6, 'Raquel', 'Castellanos Alfonso','Granada','1284985407'),
  (7, 'Mabel', 'Martínez Rodríguez','Barcelona','1284365407'),
  (8, 'Paola', 'Sánchez Solórzano','Barcelona','626148965'),
  (9, 'Lidia', 'Fraile Martín','Valencia','1277985407'),
  (10, 'Gloria', 'Gonzáles Muñoz','Madrid','1564895407')
  
]

try: 
    mycursor.executemany(sql, val)
    cnx.commit()
    print(mycursor.rowcount, "registro/s insertado/s.")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

10 registro/s insertado/s.

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [26]:
# realizamos la conexión con el servidor
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='alumnas_promo_H')


# escribimos nuestra query
sql_todas_alum = "SELECT * FROM ALUMNAS_PROMO"

# utilizamos el método pd.read_sql_qury() para convertir los resultados de nuestra query en un DataFrame que podamos ver de forma amigable en Python
df = pd.read_sql_query(sql_todas_alum, cnx )


#Lo siguiente es un wrap up que funciona tanto con una tabla como con una consulta SQL.
#pd.read_sql(sql, cnx)

#Cerramos la conexion
cnx.close()

#establesco como indice el ID
df_alumnas =df.set_index('ID') 

#imprimo la tabla
df_alumnas

       NOMBRE            APELLIDOS     CIUDAD    TELEFONO
ID
1       Nuria         Cano Girones     Madrid  1234657810
2    Patricia      González Gruber   Valencia  1289546107
3   Margarita     Torres Rodriguez     Madrid  1287854107
4    Violaine            Deloutsal     Madrid  1281234107
5       Diana        García Martín     Madrid  1284312107
6      Raquel  Castellanos Alfonso    Granada  1284985407
7       Mabel   Martínez Rodríguez  Barcelona  1284365407
8       Paola    Sánchez Solórzano  Barcelona   626148965
9       Lidia        Fraile Martín   Valencia  1277985407
10     Gloria       Gonzáles Muñoz     Madrid  1564895407

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

In [30]:
df_alumnas.head(3)

       NOMBRE         APELLIDOS    CIUDAD    TELEFONO
ID
1       Nuria      Cano Girones    Madrid  1234657810
2    Patricia   González Gruber  Valencia  1289546107
3   Margarita  Torres Rodriguez    Madrid  1287854107

In [31]:
df_alumnas.tail(3)

    NOMBRE          APELLIDOS     CIUDAD    TELEFONO
ID
8    Paola  Sánchez Solórzano  Barcelona   626148965
9    Lidia      Fraile Martín   Valencia  1277985407
10  Gloria     Gonzáles Muñoz     Madrid  1564895407

7. ¿Hay registros duplicados?

In [32]:
df_alumnas.duplicated()

ID
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

### Bonus:

8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [41]:
# realizamos la conexión con el servidor
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='alumnas_promo_H')


# escribimos nuestra query
sql_ciudades = "SELECT DISTINCT CIUDAD FROM ALUMNAS_PROMO"

# utilizamos el método pd.read_sql_qury() para convertir los resultados de nuestra query en un DataFrame que podamos ver de forma amigable en Python
df_ciudades = pd.read_sql_query(sql_ciudades, cnx )


#Lo siguiente es un wrap up que funciona tanto con una tabla como con una consulta SQL.
#pd.read_sql(sql, cnx)

#Cerramos la conexion
cnx.close()


#imprimo la tabla
df_ciudades

      CIUDAD
0     Madrid
1   Valencia
2    Granada
3  Barcelona

9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [43]:
# realizamos la conexión con el servidor
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='alumnas_promo_H')


# escribimos nuestra query
sql_Madrid = "SELECT  NOMBRE, APELLIDOS,CIUDAD FROM ALUMNAS_PROMO WHERE CIUDAD = 'Madrid'"
sql_Barcelona = "SELECT  NOMBRE, APELLIDOS,CIUDAD FROM ALUMNAS_PROMO WHERE CIUDAD = 'Barcelona'"

# utilizamos el método pd.read_sql_qury() para convertir los resultados de nuestra query en un DataFrame que podamos ver de forma amigable en Python
df_alumnas_Madrid = pd.read_sql_query(sql_Madrid, cnx )
df_alumnas_Barcelona = pd.read_sql_query(sql_Barcelona, cnx)

#Lo siguiente es un wrap up que funciona tanto con una tabla como con una consulta SQL.
#pd.read_sql(sql, cnx)

#Cerramos la conexion
cnx.close()

In [44]:
#imprimo la tabla alumnas_Madrid 
df_alumnas_Madrid

      NOMBRE         APELLIDOS  CIUDAD
0      Nuria      Cano Girones  Madrid
1  Margarita  Torres Rodriguez  Madrid
2   Violaine         Deloutsal  Madrid
3      Diana     García Martín  Madrid
4     Gloria    Gonzáles Muñoz  Madrid

In [45]:
#imprimo la tabla alumnas_Barcelona 
df_alumnas_Barcelona

  NOMBRE           APELLIDOS     CIUDAD
0  Mabel  Martínez Rodríguez  Barcelona
1  Paola   Sánchez Solórzano  Barcelona